

#!/bin/sh

#功能函数区域
menu(){ 
  echo -e "\033[31m            shell操作k8s管理平台\033[0m"
  echo -e "\033[32m=====================================================\033[0m"
  echo -e "\033[32m1:基础环境部署                     2：k8s内核环境配置\033[0m"
  echo -e "\033[32m3:容器环境部署                     4：k8s环境部署\033[0m"
  echo -e "\033[32m5:k8s环境管理                      6：退出操作\033[0m"
  echo -e "\033[32m=====================================================\033[0m"
}

Usage(){
  echo "请输入有效的选项ID"
  exit
}


#主函数区域
main(){
  menu
}

#调用区域
main
